<?php

header('Content-type: text/html; charset=utf-8');

require_once "URLify.php";

class UkrName {

	private $names = array(	'm'=>array("Андрій", "Арсеній", "Антоній", "Аркадій", "Артем", "Амвросій", "Архип", "Богуслав", "Богдан", "Борис", "Василь", "Вадим", "Валентин", "Валерій", "Віктор", "Віталій", "Володимир", "В'ячеслав", "Гаврило", "Геннадій", "Георгій", "Григорій", "Гліб", "Данило", "Давид", "Дем'ян", "Дмитро", "Захар", "Зорян", "Іван", "Ігор", "Ілля", "Євген", "Йосип", "Корнилій", "Костянтин", "Кирило", "Леонід", "Леонтій", "Лука", "Лук'ян", "Макар", "Максим", "Маркіян", "Марко", "Мартин", "Мар'ян", "Матвій", "Микита", "Микола", "Мирослав", "Михайло", "Мойсей", "Назар", "Нестор", "Никифор", "Олег", "Олекса", "Олександр", "Олесь", "Омелян", "Орест", "Остап", "Петро", "Павло", "Панас", "Пантелеймон", "Пилип", "Прохір", "Радомир", "Радослав", "Рафаїл", "Роберт", "Роман", "Ростислав", "Руслан", "Самуїл", "Святослав", "Северин", "Семен", "Сергій", "Симон", "Станіслав", "Степан", "Тарас", "Тимофій", "Трохим", "Федір", "Юлій", "Яків", "Ярема", "Ярослав", "Ренат"), 
							'f'=>array("Аліна", "Алла", "Альбіна", "Амалія", "Анастасія", "Аніта", "Анжела", "Ганна", "Валентина", "Варвара", "Василина", "Вікторія", "Віолетта", "Віра", "Галина", "Дарина", "Єва", "Єлизавета", "Емілія", "Ірина", "Ірена", "Камілла", "Клавдія", "Лариса", "Лілія", "Людмила", "Любов", "Марія", "Марина", "Марта", "Мар'яна", "Маруся", "Надія", "Наталія", "Розалія", "Святослава", "Сніжана", "Соломія", "Софія", "Оксана", "Олена", "Ольга", "Орина", "Роксолана", "Світлана", "Тереза", "Тетяна", "Христина", "Ярина", "Ярослава", "Юлія"));
	//private $names = array('m'=>array("Василь"), 'f'=>array("Оксана")); //DEBUG ONLY
	private $surnames = array("Бебешко", "Безручко", "Бойко", "Ботярко", "Брунько", "Валько", "Гомілко", "Данилко", "Забужко", "Зрайко", "Зубко", "Кличко", "Лешко", "Лиско", "Ляшко", "Максімко", "Маціборко", "Мицко", "Мрічко", "Наливайко", "Настобурко", "Остроушко", "Панько", "Перев'язко", "Перетятько", "Полатайко", "Половко", "Портянко", "Прилипко", "Приходько", "Ріжко", "Сірко", "Завойко", "Соломко", "Стинавко", "Сухоручко", "Сушко", "Федушко", "Фучко", "Фуфалько", "Ховавко", "Хорошко", "Храпко", "Цушко", "Цьомко", "Чуйко", "Шайко", "Шляхетко", "Шумейко", "Шпитко", "Ямборко", "Янко", "Бондаренко", "Вдовиченко", "Діденко", "Бабенко", "Гриценко", "Дем'яненко", "Зленко", "Іваненко", "Капітаненко", "Капітоненко", "Кириленко", "Коваленко", "Козубенко", "Косенко", "Лук'яненко", "Огієнко", "Павленко", "Панченко", "Пархоменко", "Петренко", "Посвятенко", "Потапенко", "Саєнко", "Симоненко", "Тарасенко", "Ткаченко", "Малаєнко", "Шевченко", "Витребенько", "Вишенько", "Кренько", "Опенько", "Потебенько", "Боєчко", "Величко", "Гричка", "Іваночко", "Леочко", "Марочко", "Семочко", "Толочко", "Юречко", "Бричка", "Киселичка", "Осьмачка", "Перепічка", "Петричка", "Барановський", "Виговський", "Гладковський", "Куликовський", "Міхновський", "Соколовський", "Стаховський", "Шовковський", "Щепановський", "Яворівський", "Алчевський", "Гриневський", "Малішевський", "Миклашевський", "Могилевський", "Трублаєвський", "Березецький", "Бесідовський", "Блажевський", "Богуславський", "Борецький", "Волинський", "Грабовецький", "Грабовський", "Долинський", "Залуцький", "Ключівський", "Коцюбинський", "Кропивницький", "Ласкорунський", "Левицький", "Лозинський", "Монастирецький", "Руданський", "Саксаганський", "Скоропадський", "Скорупський", "Старицький", "Уманський", "Чемеринський", "Яворський", "Яричківський", "Ясінський", "Андрухович", "Анкудович", "Арич", "Давидович", "Демич", "Денькович", "Дімнич", "Зварич", "Зінич", "Катрич", "Коріатович", "Коцюбович", "Кузьмич", "Лазарович", "Марич", "Матусевич", "Мацієвич", "Місярич", "Нарушевич", "Негрич", "Попадич", "Попович", "Поприч", "Потравич", "Рудич", "Рурич", "Сакевич", "Сахнович", "Сенатович", "Скибич", "Станкович", "Суранович", "Тобілевич", "Тулейбич", "Чуревич", "Шуфрич", "Шухевич", "Ягнич", "Ярич", "Юркевич", "Агеїв", "Андріїв", "Андрухів", "Бартків", "Библів", "Боцюрків", "Вальків", "Вашків", "Вінтонів", "Гаврилів", "Гнатків", "Григорців", "Гринів", "Даців", "Дем'янців", "Дирів", "Іванів", "Іванків", "Івасів", "Івахів", "Ільків", "Іпатів", "Касів", "Каськів", "Ковків", "Котів", "Лаврів", "Ленів", "Лесів", "Луців", "Марків", "Матвіїв", "Матвійців", "Матеїв", "Мацьків", "Менів", "Осадців", "Остапів", "Павлів", "Паньків", "Петрів", "Попів", "Рогів", "Романів", "Собків", "Старків", "Стасів", "Сташків", "Стефанців", "Стецьків", "Тимофіїв", "Тодорів", "Федьків", "Цапів", "Цахнів", "Юрків", "Юрців", "Арсірій", "Бабій", "Багрій", "Бедрій", "Бугрій", "Буній", "Бурій", "Гараздій", "Гладій", "Гожій", "Гулій", "Дубій", "Кахній", "Колодій", "Красій", "Курій", "Куцій", "Кучмій", "Лабій", "Маковій", "Макосій", "Марухній", "Маслій", "Олендій", "Палій", "Передерій", "Петриній", "Плаксій", "Повалій", "Смаглій", "Смолій", "Соловій", "Стогній", "Телендій", "Турій", "Цюпій", "Чорній", "Червоній", "Бегей", "Белей", "Бурмей", "Голіней", "Гордубей", "Дзюбей", "Дубей", "Збіглей", "Кобзей", "Кучмей", "Нищей", "Скоблей", "Соловей", "Фафлей", "Фокшей", "Фуштей", "Хімей", "Хруней", "Чобей", "Чумбей", "Чупрей", "Шпілей", "Шумей", "Бакай", "Басай", "Бугай", "Гайдай", "Гасай", "Горай", "Грицай", "Гультай", "Заграй", "Замай", "Кицай", "Лабай", "Мамай", "Нечай", "Полежай", "Поривай", "Походжай", "Пристай", "Рудай", "Тягай", "Шмарай", "Байдачний", "Байрачний", "Безкровний", "Безсмертний", "Бережний", "Буденний", "Бурдейний", "Бурий", "Возний", "Горбовий", "Горішний", "Гуменний", "Задолинний", "Задорожний", "Зарівний", "Кварцяний", "Кривий", "Криничний", "Лановий", "Лисий", "Лісовий", "Лужний", "Лютий", "Малий", "Мальований", "Мирний", "Многогрішний", "Мозговий", "Моцний", "Нагорний", "Наконечний", "Наріжний", "Неживий", "Піддубний", "Підхомний", "Поночовний", "Порохнявий", "Пшеничний", "Розумний", "Рудий", "Срібний", "Тисячний", "Хмарний", "Червоний", "Чоповий", "Чорний", "Яровий", "Бахматюк", "Бенюк", "Вірастюк", "Гандзюк", "Гнатюк", "Гонтарук", "Гонтюк", "Гончарук", "Гуменюк", "Данилюк", "Дмитрук", "Ерстенюк", "Завальнюк", "Книшук", "Коновалюк", "Корнелюк", "Костюк", "Косюк", "Лейб'юк", "Лелюк", "Лисканюк", "Литвинюк", "Майструк", "Мандзюк", "Мацюк", "Меланюк", "Менделюк", "Михайлюк", "Момотюк", "Палагнюк", "Петрук", "Римарук", "Романюк", "Сердюк", "Симовонюк", "Тарасюк", "Тефледжук", "Цехміструк", "Омельнук", "Сребнюк", "Науменюк", "Бойчук", "Будейчук", "Буждиганчук", "Васильчук", "Дем'янчук", "Зеленчук", "Ковальчук", "Корнійчук", "Кравчук", "Кухарчук", "Лісничук", "Манівчук", "Мархайчук", "Мисливчук", "Ставнійчук", "Шевчук", "Шинкарчук", "Яремчук", "Данищук", "Курищук", "Лайщук", "Ліщук", "Мартищук", "Пліщук", "Поліщук", "Сіщук", "Стельмащук", "Суфрищук", "Хащук", "Бородач", "Головач", "Горбач", "Деркач", "Копач", "Косач", "Лукач", "Мордач", "Мохнач", "Пугач", "Сікач", "Ткач", "Трач", "Товкач", "Андрусяк", "Байдак", "Барбазяк", "Бурлак", "Гнатишак", "Грабчак", "Гринішак", "Дричак", "Дутчак", "Залізняк", "Лапчак", "Лемчак", "Лютак", "Матчак", "Недоляк", "Недяк", "Новак", "Пендорак", "Петруняк", "Пилип'як", "Півторак", "Приймак", "Пришляк", "Проскурняк", "Рубчак", "Цюрак", "Чумак", "Чущак", "Щербак", "Баторик", "Белдик", "Бердник", "Білик", "Бібік", "Бортник", "Бублик", "Будник", "Булелик", "Вацик", "Веприк", "Дідик", "Дубик", "Зубик", "Лаврик", "Лінник", "Масник", "Медик", "Молитовник", "Нейлик", "Петрик", "Попик", "Рокосовик", "Рудик", "Сірик", "Стецик", "Сульжик", "Товщик", "Томашик", "Федик", "Фелик", "Фурик", "Цебрик", "Чаплик", "Четверик", "Чопик", "Більник", "Бортник", "Бузник", "Винник", "Голованнік", "Житник", "Жупник", "Килимник", "Колісник", "Колопельник", "Конопельник", "Лазебник", "Лінник", "Мельник", "Мечник", "Мірошник", "Молитовник", "Олійник", "Пасічник", "Потятинник", "Ризник", "Серветник", "Скрипник", "Стадник", "Старожитник", "Степник", "Телятник", "Тютюнник", "Флисник", "Баранець", "Бобинець", "Василець", "Воробець", "Годованець", "Горобець", "Коломієць", "Курілець", "Лебединець", "Лукачинець", "Мартинець", "Масинець", "Москалець", "Ордець", "Перегінець", "Писклинець", "Піхманець", "Погорілець", "Попадинець", "Романець", "Рошинець", "Степанець", "Українець", "Уманець", "Фарбанець", "Феценець", "Хованець", "Юринець", "Ясинець", "Андрусь", "Демидась", "Івась", "Карась", "Макось", "Микитась", "Петрусь", "Ромась", "Самусь", "Урбась", "Бідула", "Бурбела", "Гамула", "Гургула", "Забіла", "Зьола", "Кіцила", "Кудла", "Кукла", "Мендела", "Могила", "Притула", "Саміла", "Свягла", "Тесла", "Барило", "Бурмило", "Ворошило", "Врюкало", "Гирило", "Госедло", "Качало", "Колотило", "Косило", "Країло", "Мазило", "Мерцало", "Покотило", "Політило", "Пухкало", "Ружило", "Садло", "Смачило", "Смикало", "Стукало", "Трясило", "Цекало", "Цюпило", "Шумило", "Юрчило", "Бодайло", "Гримайло", "Жмайло", "Мазайло", "Міняйло", "Недбайло", "Нечитайло", "Пошивайло", "Процайло", "Сімкайло", "Тягайло", "Умайло", "Шмагайло", "Дахно", "Івахно", "Кохно", "Ліхно", "Махно", "Міхно", "Юхно", "Яхно", "Бульба", "Вацеба", "Дзюба", "Желіба", "Журба", "Кандиба", "Кашуба", "Костриба", "Коцаба", "Коцюба", "Коцюруба", "Кулібаба", "Лаба", "Скиба", "Скуба", "Шкраба", "Байда", "Бершеда", "Валігунда", "Васинда", "Гаверда", "Галябарда", "Гнида", "Гунда", "Дирда", "Зизда", "Кривда", "Майборода", "Меринда", "Минда", "Найда", "Негода", "Нерода", "Пойда", "Понайда", "Пригода", "Прогляда", "Рапінда", "Сверида", "Пітра", "Бандера", "Валігура", "Ванжура", "Гайдабура", "Гандера", "Говера", "Дідора", "Дудидра", "Кузюра", "Кучера", "Магера", "Мандибура", "Петлюра", "Пригара", "Сосюра", "Хмара", "Цюцюра", "Черепара", "Яцура", "Баб'яр", "Батир", "Боднар", "Бондар", "Винокур", "Гайдар", "Гончар", "Грабар", "Гузар", "Гусар", "Діхтяр", "Кантор", "Качур", "Кобзар", "Козар", "Комар", "Костур", "Кочмар", "Кухар", "Кухтар", "Кушнір", "Мазур", "Маляр", "Муляр", "Огар", "Олефір", "Осудар", "Паламар", "Панікар", "Пекар", "Питляр", "Пушкар", "Римар", "Рицар", "Сандир", "Совгир", "Сідляр", "Січкар", "Слюсар", "Соляр", "Сподар", "Шинкар", "Ясляр", "Андріяш", "Барабаш", "Болюбаш", "Василаш", "Гаврилаш", "Гайдаш", "Гармаш", "Гнідаш", "Григораш", "Дмитраш", "Кайдаш", "Каралаш", "Кібаш", "Кінаш", "Климаш", "Курташ", "Осташ", "Петраш", "Сабадаш", "Талпаш", "Бардиш", "Гавриш", "Гладиш", "Громиш", "Даниш", "Малиш", "Скубиш", "Черниш", "Андрух", "Дідух", "Балабух", "Вантух", "Ветух", "Гладух", "Гречух", "Карпух", "Кітнюх", "Кутельмах", "Куцах", "Мелюх", "Пінах", "Стельмах", "Шатух", "Бакун", "Бігун", "Брехун", "Буркун", "Вергун", "Гладун", "Дергун", "Драгун", "Жидун", "Кавун", "Ковтун", "Кривцун", "Крицун", "Левкун", "Легкун", "Мазун", "Мекшун", "Моргун", "Овдун", "Падун", "Прядун", "Різун", "Рябцун", "Скакун", "Скікун", "Супрун", "Тихун", "Трясун", "Чаклун", "Чмихун", "Довгаль", "Древаль", "Кисіль", "Коваль", "Козубаль", "Кошіль", "Кошель", "Курпіль", "Курпель", "Моргаль", "Смаль", "Чепіль", "Чечіль", "Бажан", "Балабан", "Баран", "Білан", "Білоган", "Болехан", "Больбан", "Будзан", "Вельган", "Глодан", "Гупан", "Драган", "Дараган", "Жадан", "Капітан", "Катаман", "Качкан", "Клебан", "Коритан", "Косован", "Кохан", "Коцан", "Кочерган", "Крисан", "Кузан", "Лупан", "Мацкан", "Мицан", "Мовчан", "Ожоган", "Пацкан", "Продан", "Рубан", "Скидан", "Стовбан", "Стрілан", "Строкан", "Тофан", "Уштан", "Хлопан", "Цуркан", "Чабан", "Чокан", "Юран", "Горбань", "Головань", "Довгань", "Лукань", "Щербань", "Андрусишин", "Антонишин", "Василишин", "Ващишин", "Вінтонишин", "Грещишин", "Данилишин", "Дмитришин", "Іванишин", "Іванчишин", "Ковальчишин", "Лазоришин", "Лещишин", "Микитишин", "Михайлишин", "Омельчишин", "Павлишин", "Петришин", "Романишин", "Самокишин", "Симчишин", "Стасишин", "Стефанишин", "Стецишин", "Яцишин", "Федунишин", "Андріятин", "Вдовчин", "Вольвин", "Вульчин", "Глюздин", "Губчин", "Гуйтин", "Гутин", "Досин", "Дутчин", "Калин", "Кобрин", "Коляджин", "Кузьмин", "Кустрин", "Лецин", "Литвин", "Луцин", "Лучин", "Люсін", "Малетин", "Марусин", "Микитин", "Миклин", "Микулин", "Мойсин", "Овчарчин", "Олексин", "Ровенчин", "Родчин", "Савчин", "Сікорин", "Татарин", "Томин", "Турчин", "Усин", "Федемин", "Хомин", "Цінурчин", "Челядин", "Чигрин", "Штогрин", "Шулепин", "Білиця", "Квасниця", "Киселиця", "Костриця", "Медуниця", "Паляниця", "Басюга", "Бельмега", "Булига", "Вервега", "Верига", "Генега", "Гіга", "Деренюга", "Длябога", "Досига", "Карнага", "Ломага", "Мадрига", "Нагога", "Некига", "Рига", "Сапіга", "Смага", "Сопуга", "Хоруга", "Чепига", "Чернега", "Бурлака", "Гайдамака", "Мусіяка", "Заїка", "Кукуріка", "Музика", "Партика", "Привика", "Фабрика", "Цаприка", "Бандурка", "Бірка", "Голубка", "Грушка", "Жилка", "Здерка", "Кавка", "Ключка", "Костка", "Криска", "Крупка", "Медулька", "Мишоловка", "Муринка", "Падалка", "Плесканка", "Фігурка", "Цибулька", "Цяпка", "Шліхутка", "Васюта", "Джигіта", "Кмита", "Кухта", "Магомета", "Максюта", "Піхота", "Плахта", "Репета", "Сикута", "Ракита", "Лагута", "Заверуха", "Завірюха", "Капруха", "Наталуха", "Солодуха", "Стреха", "Четвертуха", "Беньо", "Пахньо", "Худьо", "Цільо", "Буруля", "Боруля", "Бушуля", "Мигуля", "Моргуля", "Фасоля", "Квасоля", "Головня", "Махиня", "Потебня", "Порохня", "Іванина", "Кулина", "Михайлина", "Солонина", "Біловол", "Біловус", "Голобородько", "Кривоніс", "Криворучко", "Рябоконь", "Твердохліб", "Чорновіл", "Вернигора", "Нагнибіда", "Непийвода", "Перебийніс", "Підопригора", "Тягнибок", "Козоріз", "Мукоїд", "Мукомел", "Муковоз", "Пивовар");
	//private $surnames = array("Яворівський"); //DEBUG ONLY

	private $streets = array("Коцюбинського", "Перемоги", "Романа Гурика", "Автоливмашівська", "Полковника Андрусяка", "Базарна", "Степана Бандери", "Барвиста", "Барнича", "Басараб", "Бачинського Левка", "Бельведерська", "Берегова", "Биха", "Біла", "Білозіра", "Блавацького Отця", "Бобикевича", "Богунська", "Боєслава", "Бориславська", "Ботанічна", "Будівельна", "Букатчука", "Буковинська", "Вагилевича", "Валова", "Василишина", "Василіянок", "Вербицького", "Вербова", "Верховинська", "Весела", "Весняна", "Виговського", "Височана", "Витвицького", "Вишиваного", "Вишнева", "Вишневського", "Військова", "Військових ветеранів", "Вільна", "Вінницька", "Вірменська", "Вітовського Дмитра", "Вічева", "Вовчинецька", "Войцюка", "Волинська", "Володимира Великого", "Волошина", "Вороного М.", "Гаврилова", "Газова", "Галечко Софії", "Галицька", "Гаморака", "Гарагашьяна А.", "Гарбарська", "Гаркуші", "Гвардійська", "Героїв Крут", "Героїв-пожежних", "Героїв УПА", "Герцена", "Гімназійна", "Глібова", "Глінки", "Гнатюка академіка", "Гоголя", "Голинського сотника", "Головатого Антона", "Гончара", "Горбачевського 	Димитрова", "Гординського", "Горохолинська", "Грома полковника", "Грушевського Михайла", "Грюнвальдська", "Гулака-Артемовського", "Гуцульська", "Далека", "Данилевського", "Дем'янів Лаз", "Деповська", "Джерельна", "Дмитерка Софрона", "Дністровська", "Добролюбова", "Довбуша", "Довга", "Довженка", "Докучаєва", "Донцова", "Дорошенка П. Гетьмана", "Дослідна", "Достоєвського", "Драгоманова", "Дружби", "Дудаєва Джохара", "Дучимінської Ольги", "Євшана", "Європейська", "Єфремова Сергія", "Желехівського", "Заболотівська", "Загвіздянська", "Заклинських", "Заливахи О.", "Залізнична", "Заньковецької", "Запорізька", "Затишна", "Зв’язкова", "Зелена", "Зорія М.", "Зразкова", "Івасюка В.", "Іллєнка", "Індустріальна", "Івана Павла ІІ", "Ірчана", "Калнишевського П.", "Каменярів", "Кармелюка", "Карпатська", "Карпатської Січі", "Карпенка – Карого", "Карпінського Ф.", "Карпинця Я.", "Касіяна", "Каховська", "Квітки - Основ'яненка", "Київська", "Кисілевської О.", "Княгинин", "Кобилянської", "Кобринської", "Ковалевської", "Ковальська", "Козацька", "Колективна", "Коломийська", "Комунальна", "Кондукторська", "Коновальця Євгена", "Коперніка", "Короленка", "Короля Данила", "Коротка", "Косівська", "Космічна", "Котляревського", "Коцюбинського", "Кравецька", "Кравченко Уляни", "Крайківського", "Красівського З.", "Крива", "Кривоноса", "Кримська", "Кропивницького", "Крука Григора", "Крушельницької", "Кубійовича", "Купчинського Романа", "Курбаса Леся", "Курівця Івана", "Левинського І.", "Левицького Романа", "Лемківська", "Ленкавського", "Леонтовича", "Лепкого Богдана", "Лермонтова", "Лесіва Отця", "Лисенка", "Лісова", "Лозова", "Лугова", "Лучна", "Львівська", "Любачівського Кардинала", "Лятишевського Івана", "Мазепи Гетьмана", "Макаренка", "Макогона", "Максимовича", "Маланюка В.", "Малицької Костантини", "Манюха В.", "Марка Вовчка", "сотника Мартинця", "Мартовича Леся", "Матіїва-Мельника", "Матейка", "Медична", "Мельника Андрія", "Мельничука", "Меморіальна", "Менделеєва", "Мечникова", "Микитинецька", "Миколайчука Івана", "Мирного Панаса", "Мирона Івана", "Миру", "Міхновського М.", "Міцкевича", "Млинарська", "Молдавська", "Молодіжна", "Моршинська", "Мочульського М.", "Набережна", "Надвірнянська", "Надрічна", "Нафтова", "Національної Гвардії", "Незалежності", "Некрасова", "Нескорених", "Нечуя – Левицького", "Низова", "Нова", "Новаківського", "Новгородська", "Новий Світ", "Об’їздова", "Огарьова", "Одеська", "Озаркевича Євгена", "Озерна", "Олесницького Юлія", "Ольжича", "Опільського", "Опришівецька", "Орлика Пилипа", "Островського", "Павлика М.", "Палія Андрія", "Паркова", "Пасічна", "Пасічанська", "Патона", "Патріарха Володимира", "Пашницького", "Пекарська", "Перехідна", "Переяславська", "Петлюри Симона", "Петрушевича Є.", "Південний бульвар", "Північний бульвар", "Підгірянки Марійки", "Побутова", "Подільська", "Покутська", "Полотнюків", "Полуботка", "Польова", "Поперечна", "Пржевальського", "Привокзальна", "Промислова", "Проста", "Простора", "Профспілкова", "Прутська", "Пстрака Я.", "Пулюя І.", "Радіщева", "Ребета Л.", "Ремболовича", "Реміснича", "Республіканська", "Рєпіна", "Рильського", "Ринок вул.", "Ринок пл.", "Рівна", "Робітнича", "Романчука Ю.", "Ромена", "Руднєва", "Руставелі Ш.", "Русової Софії", "Сабата М.", "Сагайдачного гетьмана", "Садовий пров.", "Саєвича Миколи", "Самійленка", "Сахарова академіка", "Світла", "Селянська", "Сем'янчука", "Сєченова", "Симиренків", "Симоненка Василя", "Сірика", "Січеславська", "Січинського", "Січка Василя", "Січових", "Сковороди Г.", "Сліпого Йосифа", "Слов'янська", "Снігуровича С.", "Сніжна", "Солотвинська", "Сонячна", "Сорохтея О.", "Сосенка М.", "Софіївка", "Спокійна", "Спортивна", "Станіславська", "Старицького", "Старозамкова", "Стельмаховича", "Стефаника", "Стецько Слави", "Страчених націоналістів", "Стрийська", "Стуса Василя", "Сухомлинського", "Танкістів", "Тарнавського генерала", "Тесленка", "Тисменицька", "Тиха", "Тичини", "Товарна", "Токарська", "Толстого", "Торгова", "Трачів", "Трильовського Кирила", "Тринітарська", "Тролейбусна", "Угорницька", "Угорська", "Ужгородська", "Лесі Українки", "Українська", "Українських Декабристів", "Української Дивізії", "Урожайна", "Ушинського", "Федьковича", "Фіголя Михайла", "Флотська", "Фортечна", "Івана Франка", "Харківська", "Хіміків", "Богдана Хмельницького", "Хомишина", "Хотинська", "Хоткевича", "Хриплинська", "Цвєк Дарії", "Целевича Юліана", "Церковна", "Циганкова Дмитра", "Ципки", "Ціолковського", "Цьоклера", "Чайковського", "Челюскінців", "Черемшини", "Чехова", "Чиста", "Чорновола", "Чорноти курінного", "Чубинського", "Шашкевича", "Шевченка", "Шептицького", "Шеремети", "Шкільна", "Шопена", "Шпитальна", "Шухевичів", "Юності", "Яновича", "Яремчука", "Яросевича Романа", "Ясінських", "Ясна");
	private $cities = array(	'Київська'=>array("Київ", "Біла Церква", "Бровари", "Бориспіль", "Фастів", "Ірпінь", "Вишневе", "Васильків", "Боярка", "Обухів", "Буча", "Переяслав-Хмельницький", "Вишгород", "Славутич", "Яготин", "Богуслав", "Сквира", "Березань"), 
								'Харківська'=>array("Харків"), 
								'Дніпропетровська'=>array("Дніпро", "Кривий Ріг", "Кам'янське"),
								'Донецька'=>array("Донецьк", "Маріуполь", "Макіївка", "Горлівка"),
								'Запорізька'=>array("Запоріжжя"),
								'Львівська'=>array("Львів"),
								'Миколаївська'=>array("Миколаїв"),
								'Луганська'=>array("Луганськ"),
								'Вінницька'=>array("Вінниця"),
								'Автономна Республіка Крим'=>array("Севастополь", "Сімферополь"),
								'Херсонська'=>array("Херсон"),
								'Полтавська'=>array("Полтава", "Кременчук"),
								'Чернігівська'=>array("Чернігів", "Ніжин"),
								'Черкаська'=>array("Черкаси"),
								'Житомирська'=>array("Житомир"),
								'Сумська'=>array("Суми", "Конотоп"),
								'Хмельницька'=>array("Хмельницький", "Кам'янець-Подільський"),
								'Чернівецька'=>array("Чернівці"),
								'Рівненська'=>array("Рівне"),
								'Кіровоградська'=>array("Кропивницький"),
								'Івано-Франківська'=>array("Івано-Франківськ"),
								'Тернопільська'=>array("Тернопіль"),
								'Волинська'=>array("Луцьк"),
								'Закарпатська'=>array("Ужгород", "Мукачеве"),
								'Одеська'=>array("Одеса"));
	
	private $phones = array('099', '096', '050', '067', '095', '066');
	
	private $gender;

	public function getRandomFirstName($gender) {
		if($gender!='m' && $gender!='f') throw new Exception($this->_requestStatus(403));
		return $this->names[$gender][(rand(0,count($this->names[$gender])-1))];
	}
	
	public function getRandomSurname($gender='') {
		$surname = $this->surnames[(rand(0,count($this->surnames)-1))];
		//check female surname
		if($gender == 'f' && substr($surname, strlen($surname)-4) == "ий") {
			$surname = substr($surname, 0,strlen($surname)-4)."а";
		}
		return $surname;
	}
	
	public function getRandomFathername($gender) {
		if($gender!='m' && $gender!='f') throw new Exception($this->_requestStatus(403));
		$fathername = $this->getRandomFirstName('m');
		
		//check 'o' in fathername
		//	echo "checking ".substr($fathername, strlen($fathername)-2)."<br>";
		if (substr($fathername, strlen($fathername)-2) == "о" ||
			substr($fathername, strlen($fathername)-2) == "а") {
			$fathername = substr($fathername, 0,strlen($fathername)-2);
		}
		//	echo "checking ".substr($fathername, strlen($fathername)-4)."<br>";
		if (substr($fathername, strlen($fathername)-4) == "ів") {
			$fathername = substr($fathername, 0,strlen($fathername)-4);
		}//	echo "checking ".substr($fathername, strlen($fathername)-4)."<br>";
		if (substr($fathername, strlen($fathername)-4) == "ір") {
			$fathername = substr($fathername, 0,strlen($fathername)-4).'ор';
		}
		
		//check gender fathername
		if($gender == 'f') {
			//	echo "checking ".substr($fathername, strlen($fathername)-2)."<br>";
			//	echo "checking ".substr($fathername, strlen($fathername)-4)."<br>";
			if (substr($fathername, strlen($fathername)-4) == "ій") {
				$fathername = substr($fathername, 0,strlen($fathername)-4).'іївна';
			}
			else if (substr($fathername, strlen($fathername)-2) == "й") {
				$fathername = substr($fathername, 0,strlen($fathername)-2).'ївна';
			}
			else if (substr($fathername, strlen($fathername)-2) == "б") {
				$fathername = substr($fathername, 0,strlen($fathername)-2).'овна';
			}
			else if (substr($fathername, strlen($fathername)-2) == "я") {
				$fathername = substr($fathername, 0,strlen($fathername)-2).'івна';
			}
			else if (substr($fathername, strlen($fathername)-2) == "ь") {
				$fathername = substr($fathername, 0,strlen($fathername)-2).'іївна';
			}
			else {
				$fathername = $fathername.'івна';
			}
		}
		else {
			if (substr($fathername, strlen($fathername)-2) == "я") {
				$fathername = substr($fathername, 0,strlen($fathername)-2).'іч';
			}
			else {
				$fathername = $fathername.'ович';
			}
		}
		return $fathername;
	}
	
	public function getRandomName($gender='', $as_array = false) {
		if(!$gender) $gender = $this->getRandomGender(); //throw new Exception($this->_requestStatus(405));
		
		$name = $this->getRandomFirstName($gender);
		
		$surname = $this->getRandomSurname($gender);
		
		$fathername = $this->getRandomFathername($gender);
		
		if($as_array) {
			return array('name'=>$name, 'surname'=>$surname, 'fathername'=>$fathername);
		}
		return "$surname $name $fathername";
	}
	
	public function getRandomGender() {
		return (rand(0,9)>5)?'m':'f';
	}
	
	public function getRandomStreet() {
		return "вул. ".$this->streets[(rand(0,count($this->streets)-1))].", буд. ".rand(1,200).", кв. ".rand(1,100);
	}
	
	public function getRandomCity($region, $as_array = false) {
		if (!$region || !$this->cities[$region]) {
			$region = $this->getRandomRegion();
		}
		
		$city = $this->cities[$region][(rand(0,count($this->cities[$region])-1))];
		
		if ($as_array) {
			return array('region'=>$region, 'city'=>$city);
		}
		return "$region обл., м. $city";
	}
	
	public function getAllRegions() {
		$regions = array();
		foreach($this->cities as $temp_region=>$temp_cities) {
			$regions[] = $temp_region;
		}
		sort($regions);
		return $regions;
	}
	
	public function getRandomRegion() {
		$rand_region = (rand(0,count($this->cities)-1));
		foreach($this->cities as $temp_region=>$temp_cities) {
			$region = $temp_region;
			if (!$rand_region) break;
			else $rand_region--;
		}
		return $region;
	}
	
	public function getRandomAddress($region='',$as_array = false) {
		if (!$this->cities[$region]) {
			$region = $this->getRandomRegion();
		}
		if($as_array) {
			$city = $this->getRandomCity($region,true);
			return array('street'=>$this->getRandomStreet(), 'region'=>$city['region'], 'city'=>$city['city']);
		}
		return $this->getRandomCity($region).", ".$this->getRandomStreet();
	}
	
	public function getRandomPassport($new = false) {
		if ($new) {
			return rand(100000000,999999999);
		}
		$letters_a = array('А', 'Е', 'Є', 'И', 'І', 'О', 'У', 'Ю', 'Я');
		$letters_b = array('Б', 'В', 'Г', 'Д', 'Ж', 'З', 'К', 'Л', 'М', 'Н', 'П', 'Р', 'С', 'Т', 'Ф', 'Х', 'Ч', 'Ш');
		return $letters_b[rand(0,count($letters_b)-1)].$letters_a[rand(0,count($letters_a)-1)].rand(100000,999999);
	}
	
	public function getRandomPhone() {
		return "+38 ".$this->phones[(rand(0,count($this->phones)-1))]." ".rand(100,999)." ".rand(1000,9999);
	}
	
	public function getRandomDOB($start_date,$end_date) {
		$min = strtotime($start_date);
		$max = strtotime($end_date);
		if (!$min) {
			$min = strtotime("-100 year");
		}
		if (!$max) {
			$max = strtotime("-1 year");
		}
		$val = rand($min, $max);
		return date('Y-m-d', $val);
	}
	
	public function getAgeFromDOB($DOB) {
		$TOB = strtotime($DOB);
		$age = (date("md", date("U", mktime(0, 0, 0, date('m',$TOB), date('d',$TOB), date('Y',$TOB)))) > date("md")
		? ((date("Y") - date('Y',$TOB)) - 1)
		: (date("Y") - date('Y',$TOB)));
		return $age;
	}
	
	public function getTitleForYears($years) {
		while($years >= 100) {
			$years -= 100;
		}
		if($years>=10 && $years<=20) return 'років';
		
		while($years >= 10) {
			$years -= 10;
		}
		if($years == 1) return 'рік';
		else if($years>=2 && $years<=4) return 'роки';
		return 'років';
	}
	
	public function getZodiacFromDOB($DOB) {
		$TOB = strtotime($DOB);
		$month = date('m',$TOB);
		$day = date('d',$TOB);
		switch($month) {
			case 1: return (($day>20)?'Водолій':'Козоріг'); break;
			case 2: return (($day>20)?'Риби':'Водолій'); break;
			case 3: return (($day>20)?'Овен':'Риби'); break;
			case 4: return (($day>20)?'Телець':'Овен'); break;
			case 5: return (($day>20)?'Близнята':'Телець'); break;
			case 6: return (($day>21)?'Рак':'Близнята'); break;
			case 7: return (($day>22)?'Лев':'Рак'); break;
			case 8: return (($day>23)?'Діва':'Лев'); break;
			case 9: return (($day>23)?'Терези':'Діва'); break;
			case 10: return (($day>23)?'Скорпіон':'Терези'); break;
			case 11: return (($day>22)?'Стрілець':'Скорпіон'); break;
			case 12: return (($day>21)?'Козоріг':'Стрілець'); break;
			default: return ''; break;
		}
	}
	
	public function getRandomCreditCard($with_spaces = true) {
		$delimiter = ($with_spaces)?' ':'';
		$year = date('Y');
		
		$type = 'visa'; //VISA only support yet
		$number = '4'.rand(100,999).$delimiter.rand(1000,9999).$delimiter.rand(1000,9999).$delimiter.rand(1000,9999);
		$expire_y = rand($year+1,$year+4);
		$expire_m = rand(1,12);
		$cvv = rand(100,999);
		
		return array('type'=>$type, 'number'=>$number, 'cvv'=>$cvv, 'expire'=>array('month'=>$expire_m,'year'=>$expire_y));
	}
	
	public function getRandomPassword($length = 8) {
		$alphabet = 'abcdefghijklmnopqrstuwxyzABCDEFGHIJKLMNOPQRSTUWXYZ';
		$special = '0123456789!@#$%^&*_=+-0123456789';
		$pass = array();
		$alphaLength = strlen($alphabet) - 1;
		$specialLength = strlen($special) - 1;
		for ($i = 0; $i < $length && $i < 20; $i++) {
			if($i%2){
				$pass[] = $special[rand(0, $specialLength)];
			}
			else {
				$pass[] = $alphabet[rand(0, $alphaLength)];
			}
		}
		return implode($pass);
	}
	
	public function getRandomUsername($name, $DOB) {
		return str_replace(' ', '', /*strtolower*/($name)).(($DOB)?date('Y',strtotime($DOB)):rand(0,100));
	}
	
	public function getRandomEmail($name) {
		$domains = array('tymur.org', 'fex.net', 'ex.ua', 'ukr.net', 'gmail.com');
		return $this->getRandomUsername($name).'@'.$domains[rand(0,count($domains)-1)];
	}
	
	public function getRandomWebsite($name) {
		$domains = array('com.ua', 'biz.ua', 'net.ua', 'org.ua', 'co.ua', 'in.ua', 'ua');
		$name = strtolower(str_replace(array(" ","'"), '', $name));
		return $name.'.'.$domains[rand(0,count($domains)-1)];
	}
	
	private function _requestStatus($code) {
        $status = array(  
            200 => 'OK',
            403 => 'Unknown Gender',
            404 => 'No Name Found',
            405 => 'No Gender Passed',
            500 => 'Internal Server Error'
        ); 
        return ($status[$code])?$status[$code]:$status[500]; 
    }

}


/*

$ukrname = new UkrName();
$my_name = $ukrname->getRandomName();
$latin_name = URLify::downcode($my_name);

log_status($my_name." ($latin_name)");
log_status($ukrname->getRandomAddress());
log_status($ukrname->getRandomPhone());

$cc = $ukrname->getRandomCreditCard();
log_status($cc['number'].' '.$cc['expire']['month'].'/'.$cc['expire']['year'].' ('.$cc['cvv'].')');


function log_status($string) {
	echo "<p>$string</p>";
}
 
*/
